# Функция wins()
# В онлайн-школе BEEGEEK каждое лето проходят соревнования по шахматам, во время которых ведется статистика побед и
# поражений. Каждая партия описывается кортежем из двух элементов, где первый элемент — имя победившего ученика, второй
# элемент — имя проигравшего ученика.
#
# Реализуйте функцию wins(), которая принимает один аргумент:
#
# pairs — итерируемый объект, элементами которого являются кортежи, каждый из которых представляет собой пару имён
# победитель-проигравший
# Функция должна возвращать словарь, в котором ключом служит имя ученика, а значением — множество (тип set) имен
# учеников, которых он победил.

from collections import defaultdict


def wins(data):
    res = defaultdict(set)
    for winner, lossers in data:
        res[winner].add(lossers)
    return res
