# Високосный год
# Напишите программу, которая определяет, является ли год високосным.

import calendar

[print(calendar.isleap(int(input()))) for _ in range(int(input()))]
