# Функция filter_anagrams()
# Анаграммы — это слова, которые состоят из одинаковых букв. Например:
#
# адаптер — петарда
# адресочек — середочка
# азбука — базука
# аистенок — осетинка
# Реализуйте функцию filter_anagrams(), которая принимает два аргумента в следующем порядке:
#
# word — слово в нижнем регистре
# words — список слов в нижнем регистре
# Функция должна возвращать список, элементами которого являются слова из списка words, которые представляют анаграмму
# слова word. Если список words пуст или не содержит анаграмм, функция должна вернуть пустой список.

def filter_anagrams(word, words):
    res = []
    for w in words:
        if sorted(word) == sorted(w):
            res.append(w)
    return res
