# Трудности перевода
# Зачастую переводить сериалы, не теряя изначальный смысл, невозможно, особенно за счет игр слов. Сумасшедший режиссер
# хочет снять сериал, в котором бы в целях эксперимента задействовал как можно больше языков, чтобы пользоваться
# красотой каждого из них. Тем не менее если задействовать слишком много языков, то сериал станет непонятен абсолютно
# всем, поэтому режиссер достает случайных людей на улице и спрашивает их, какие языки они знают, таким образом он
# будет использовать языки которые знают все из них.
#
# Напишите программу, которая определяет, какие языки будут использоваться в сериале.

from functools import reduce

n = int(input())
lst = [set(input().split(', ')) for _ in range(n)]
res = list(reduce(lambda a, b: a & b, lst))
if res:
    print(*sorted(res), sep=", ")
else:
    print("Сериал снять не удастся")
